Tekla.Structures.CatalogInternal.dotcatProfileItemParameter_t
Serialization structure for Profile Item Parameter.

Tekla.Structures.CatalogInternal.dotcatProfileItemParameter_t.aProperty
The property/description of the parameter.

Tekla.Structures.CatalogInternal.dotcatProfileItemParameter_t.aSymbol
The symbol of the parameter.

Tekla.Structures.CatalogInternal.dotcatProfileItemParameter_t.Value
The value of the parameter.

Tekla.Structures.CatalogInternal.dotcatProfileItemParameter_t.aStringValue
The string value of the parameter.

Tekla.Structures.CatalogInternal.dotcatProfileItemParameter_t.ParameterUnitType
The parameter unit type.

Tekla.Structures.CatalogInternal.dotcatProfileItemParameter_t.CrossSectionNumber
The cross section number.